namespace OfdSharp.Core.Graph.PathObj
{
    /// <summary>
    /// 图形的填充规则
    /// </summary>
    public enum FillRule
    {
        /// <summary>
        /// 非零绕数规则，从所需判断的点处向任意方向无穷远处引一条射线,同时引入一个初始值为0的计数,
        /// 射线每经过一条由左至右方向的线型时计数加1,
        /// 射线每经过一条由右至左方向的线型时则计数减1,
        /// 如果每条射线总计数均为0,则判断该点在路径外部,反之,则该点在路径内部
        /// </summary>
        NonZero,

        /// <summary>
        /// 奇偶规则，从所需判断的点处向任意方向无穷远处引一条射线,
        /// 同时引入一个初始值为0的计数,射线每经过任意线型时计数加1,
        /// 如果每条射线总计数均为奇数,则判断该点在路径内部,反之,则该点在路径外部
        /// </summary>
        EvenOdd
    }
}
